---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConnectorLength
source: html/630d247b-b485-5197-b2ec-1ddf072858cd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConnectorLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId ConnectorLength { get; }
```